async def handle_bots(client, chat_id):
    await client.send_message(
        chat_id,
        "🤖 **Muhamed IT Solutions** — команда профессионалов, специализирующаяся на создании инновационных решений в области IT. 🚀\n\n"
        "Мы занимаемся разработкой ботов, автоматизацией процессов и цифровым маркетингом.\n\n"
        "🛠️ Наши ключевые боты:\n"
        "1️⃣ [Project Manager](https://t.me/ProManagerss_bot) — Управление проектами и задачами.\n"
        "2️⃣ [Game Quest](https://t.me/GQ_newsbot) — Новости и обновления мира игр.\n"
        "3️⃣ [Nanson](https://t.me/Nanson_CFNbot) — Помощь в обучении и карьерном росте.\n"
        "4️⃣ [Kinani Family](https://t.me/KinaniFamily_bot) — Общение и поддержка для всей семьи.\n\n"
        "🎮 **Discord боты** — У нас есть несколько Discord ботов, но они доступны на разных проектах.\n\n"
        "Присоединяйтесь к нашим ботам и узнайте, как они могут улучшить ваши процессы! 🌟",
        file="Фото_материал/3 copy.png"  # Укажите путь к файлу изображения
    )
